A = [2, 3, 5, -2, 1; 4, 1, -1, 3, 6; 1, 5, 2, 4, -2; 3, -2, 4, 6, 1; 5, 1, 3, 2, 7];
B = [7; 24; 19; 19; 23];

AB = [A, B];
n = size(A,1);
swaps = 0;

# Формат дробей
format rat


# ---- Задание 1 - Метод Гаусса ----

# -- ПРЯМОЙ ХОД --

# Перебор столбцов
for i = 1 : 1 : (n-1)
  i; # Номер столбца
  max_val = AB(i, i);
  max_ind= i;
  # Ищет максимум под главной диагональю
  for k = i : 1 : n
    if abs(max_val) < abs(AB(k,i))
      max_val = AB(k,i);
      max_ind = k;
    endif
  endfor

  # Свап
  if max_ind != i
    AB([i, max_ind],:) = AB([max_ind, i],:);
    swaps++;
  endif

  # Обнуление темы под диагональю
  for k = i + 1 : 1 : n
    if AB(k,i) != 0
      # Обнуление :(
      coef = AB(k, i) / AB(i, i);
      AB(k, :) = AB(k, :) - AB(i,:) * coef;
    endif
  endfor
endfor

# -- ОБРАТНЫЙ ХОД --

xs = zeros(n, 1);
AB

# Перебор строк
for i = n : -1: 1
  # Сумма известных переменных
  sum = 0;
  for ech = n : -1 : i+1
    sum = sum + AB(i, ech) * xs(ech, 1);
      endfor
  xs(i) = (AB(i, n+1) - sum )/ AB(i, i);
  xs
endfor


# ---- Задание 3 - Определитель ----
# Вычисление определителя
# У треугольной матрицы det = произведению диагональных элементов
# Каждый свап менял знак, так что (-1) на количество свапов
# AB(:, 1:n) берет АБ без последнего столбца, который бы Б

d = (-1)^swaps * prod(diag(AB(:, 1:n)))
